import random
logo = """
 ■■■■■■ ■■    ■■■■■  ■■     ■   ■■ ■■     ■■■■■  ■■      ■     ■■
     ■■ ■■   ■■■■■■■ ■■     ■   ■■ ■■    ■■■■■■■ ■■      ■     ■■
     ■■ ■■   ■■   ■■ ■■     ■   ■■ ■■    ■■   ■■ ■■      ■     ■■
     ■■ ■■   ■■■■■■■ ■■     ■■■■■■ ■■    ■■■■■■■ ■■      ■■■■■■■■
    ■■  ■■■■  ■■■■■  ■■     ■   ■■ ■■■■   ■■■■■  ■■      ■     ■■
  ■■■■  ■■           ■■     ■   ■■ ■■            ■■      ■■    ■■
 ■■■■   ■■  ■■■■■■■■■■■     ■   ■■ ■■   ■■■■■■■■■■■      ■■■■■■■■
■■■     ■■      ■■   ■■     ■■■■■■ ■■       ■■   ■■         ■■
        ■■      ■■   ■■            ■■       ■■   ■■         ■■
        ■■      ■■   ■■            ■■       ■■   ■■    ■■■■■■■■■■■■
        ■■      ■■   ■■            ■■       ■■   ■■
"""
print(logo)

rock = '''
    _______
---'   ____)
      (_____)
      (_____)
      (____)
---.__(___)
'''

paper = '''
    _______
---'   ____)____
          ______)
          _______)
         _______)
---.__________)
'''

scissors = '''
    _______
---'   ____)____
          ______)
       __________)
      (____)
---.__(___)
'''

game_list = [scissors, rock, paper]

computer = random.randint(0, 2)
user = int(input("가위(0), 바위(1), 보(2)를 입력하세요"))
print("컴퓨터 : ", game_list[computer])
print("당신 : ", game_list[user])
if computer == user:
    print("비겼습니다.")
elif (computer == 0 and user == 2) or \
    (computer == 1 and user == 0) or \
    (computer == 2 and user == 1):
     print("컴퓨터가 이겼습니다.")
else:
     print("당신이 이겼습니다! 축하합니다!")
    
